app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', 'ecc0d1b952351d1b9be693de117e91442e8faae5', '2009-07-02 02:42:04', 'a060fca50a2df8e0cc3f1eaab492c1e0cf8d184f', NULL, NULL, 'banana', 'banana@banana.com', '2009-07-02 02:42:04')